//-->只有在行首的时候才会注释单行 &&& while 循环机制 &&& 运算符优先级
function countdown(n) {
    while(n-->0){
        console.log(n);
    }
}

countdown(3);

/*------------------------------------------------------------------------------*/

//变量提升,a变量的声明会被提升并赋值undefined &&& b变量没有被声明，会报错阻断当前脚本的执行 &&& JS引擎的工作方式：先解析代码，获取所有被声明的变量，然后再一一执行
function hoisting(){
    console.log(a);
    //console.log(b);
    var a=1;
    var a;//这行代码是无效的，第二次声明（没有赋值的情况下）是无效的
}

hoisting();

/*------------------------------------------------------------------------------*/

//这种写法是错误的，因为{标点符号被视为块的开头，}标点符号被视为块的结束，而开始下一个语句的执行。
{} instanceof Object;

//正确的写法
({}) instanceof Object;